app/controllers/schoolclasses_controller.rb

SELECT "schoolclasses".* FROM "schoolclasses"
---
    def index
    @schoolclasses = Schoolclass.all

SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @schoolclass = Schoolclass.find(params[:id])

SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @schoolclass = Schoolclass.find(params[:id])

SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "schoolclasses" SET "room_number" = ?, "updated_at" = ? WHERE "schoolclasses"."id" = ?  [["room_number", 0], ["updated_at", "2018-11-05 20:57:06.914326"], ["id", 1]]
---
  def update
    @schoolclass = Schoolclass.find(params[:id])
    @schoolclass.update(schoolclass_params)