app/controllers/school_classes_controller.rb

    def create
        SchoolClass.create(class_params)
        redirect_to school_class_path(SchoolClass.last)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2020-01-21 19:05:21.890858"], ["updated_at", "2020-01-21 19:05:21.890858"]]
SELECT  "school_classes".* FROM "school_classes"  ORDER BY "school_classes"."id" DESC LIMIT 1

    def update
        @school_class = SchoolClass.find(params[:id])
		@school_class.update(class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2020-01-21 19:08:02.698541"], ["id", 1]]