app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Hannah"], ["last_name", "Chang"], ["created_at", "2018-11-05 20:20:43.514564"], ["updated_at", "2018-11-05 20:20:43.514564"]]
SELECT  "students".* FROM "students"  ORDER BY "students"."id" DESC LIMIT 1
---
  def create
    Student.create(student_params)
    redirect_to student_path(Student.last)